Repository: MichaelHany101/PulseFix
Catalog: PulseFix/Resources/Localizable.xcstrings
Source language: en
Languages: ar

# %@ • p. %lld
source: %1$@ • p. %2$lld
ar: %1$@ • ص. %2$lld

# %@ • p.%lld
source: %1$@ • p.%2$lld
ar: %1$@ • ص.%2$lld

# %lld pages • %lld chunks
source: %1$lld pages • %2$lld chunks
ar: %1$lld صفحات • %2$lld مقاطع

# approval.approve
source: Approve and Save
ar: الموافقة والحفظ

# approval.edit
source: Approved, edited, or rejected proposals appear here.
ar: تظهر هنا المقترحات التي تمت الموافقة عليها أو تعديلها أو رفضها.

# approval.reject
source: AI cannot save or execute this work order.
ar: لا يمكن للذكاء الاصطناعي حفظ أو تنفيذ أمر العمل هذا.

# approval.title
source: This Work Order needs approval from the Supervisor
ar: يتطلب أمر العمل هذا موافقة المشرف.

# common.cancel
source: Cancel
ar: إلغاء

# common.done
source: Done
ar: تم

# common.error
source: Error
ar: خطأ

# common.ok
source: OK
ar: تم

# context.characters
source: Full prompt characters
ar: عدد أحرف الطلب الكامل

# decision.approved
source: Approved
ar: تمت الموافقة

# decision.edited
source: Edited
ar: تم التعديل

# decision.rejected
source: Rejected
ar: مرفوض

source: Diagnostic Result
ar: نتيجة التشخيص

source: Editable Work Order
ar: أمر عمل قابل للتحرير

source: Equipment
ar: معدات

# equipment_description
source: Describe the industrial equipment symptom
ar: صف أعراض المعدات الصناعية

source: Hello, world!
ar: مرحبا بالعالم!

source: Import
ar: أضف

source: Industrial Diagnosis
ar: التشخيص الصناعي

source: Live metrics
ar: المقاييس الحية

source: LOCAL
ar: محلي

# manual_base
source: Local manual knowledge base
ar: قاعدة معرفة الكتيبات المحلية

source: Manual chunks
ar: مقاطع الكتيبات

# manuals.title
source: PulseFix Manuals
ar: كتيبات PulseFix

source: No Work Orders
ar: لا توجد أوامر عمل

source: Open Supervisor Approval Gate
ar: فتح بوابة موافقة المشرف

source: Optional Note
ar: ملاحظة اختيارية

# p. %lld • %.1f
source: p. %1$lld • %2$.1f
ar: ص. %1$lld • %2$.1f

source: PDF and text extraction, chunking, and search happen on this iPhone.
ar: يتم استخراج ملفات PDF والنصوص، وتقسيمها إلى أجزاء، والبحث عنها على هذا الآيفون.

source: Priority
ar: أولوية

source: Recommended Actions
ar: الإجراءات الموصى بها

source: Reject
ar: رفض

source: Retrieved Chunks
ar: الأجزاء المسترجعة

source: Retrieved Evidence
ar: الأدلة المسترجعة

source: Run Grounded Diagnosis
ar: تشغيل تشخيص مدعوم بالأدلة

source: Run Trace Inspector
ar: سجل تشغيل التشخيص

source: Safety Prerequisites
ar: متطلبات السلامة

source: Save Edited Version
ar: حفظ النسخة المعدلة

source: Source text unavailable
ar: نص المصدر غير متاح

source: State Transitions
ar: تحولات الحالة

# status.grounded
source: Grounded
ar: مدعوم بالأدلة

# status.insufficient_evidence
source: Insufficient evidence
ar: الأدلة غير كافية

# status.missing_safety_prerequisites
source: Missing safety prerequisites
ar: متطلبات السلامة مفقودة

source: Step %lld
ar: الخطوة %lld

# stream.characters_second
source: Response characters / second
ar: أحرف الاستجابة في الثانية

# stream.first_seconds
source: Time to first text
ar: زمن وصول أول نص

# stream.performance
source: Streaming performance
ar: أداء الاستجابة

# stream.preview_notice
source: Draft summary — awaiting source validation.
ar: ملخص أولي — جارٍ التحقق من المصادر.

# stream.total_seconds
source: Total request time
ar: الزمن الكلي للطلب

# streamed.characters
source: Response characters
ar: أحرف الاستجابة

source: Streaming Response
ar: استجابة البث

source: Supervisor Approval
ar: موافقة المشرف

source: Supervisor Note
ar: ملاحظة المشرف

# tab.diagnose
source: Diagnose
ar: تشخيص

# tab.manuals
source: Manuals
ar: كتيبات

# tab.trace
source: Trace
ar: يتعقب

# tab.work_orders
source: Work Orders
ar: أوامر العمل

source: Title
ar: عنوان

# trace.approval.approved
source: Work order approved
ar: تمت الموافقة على أمر العمل

# trace.approval.edited
source: Edited work order saved
ar: تم حفظ أمر العمل المعدل

# trace.approval.rejected
source: Work order rejected
ar: تم رفض أمر العمل

# trace.error
source: Operation failed
ar: تعذرت العملية

# trace.guard.noEvidence
source: Refused: no evidence
ar: رُفض التشخيص: لا توجد أدلة

# trace.guard.noSafety
source: Refused: incomplete safety evidence
ar: رُفض التشخيص: أدلة السلامة غير مكتملة

# trace.ingestion.completed
source: Import completed
ar: اكتمل الاستيراد

# trace.ingestion.started
source: Import started
ar: بدأ الاستيراد

# trace.llm.cancelled
source: Response discarded after language change
ar: تم تجاهل الاستجابة بعد تغيير اللغة

# trace.llm.completed
source: Response completed
ar: اكتملت الاستجابة

# trace.llm.streaming
source: Receiving Gemini response
ar: جارٍ استقبال استجابة Gemini

# trace.ready
source: Library loaded
ar: تم تحميل المكتبة

# trace.retrieval.completed
source: Search completed
ar: اكتمل البحث

# trace.retrieval.started
source: Search started
ar: بدأ البحث

# trace.stream.firstToken
source: First text received
ar: وصل أول جزء من النص
